# Очень часто люди в своих сообщениях не ставят заглавные буквы, особенно это стало
# массовым явлением в эру мобильных устройств. Разработайте функцию capital_text,
# которая будет принимать на вход строку с текстом и возвращать строку с восстановленными
# заглавными буквами.
#
# Функция должна:
#
# сделать заглавной первую букву в строке, несмотря на пробелы
# сделать заглавной первую букву после точки, несмотря на пробелы
# сделать заглавной первую букву после восклицательного знака, несмотря на пробелы
# сделать заглавной первую букву после вопросительного знака, несмотря на пробелы