# Задача: Аналіз даних з CSV файлу
#
# У вас є CSV файл з даними про різних студентів у форматі:
#
# Ім'я, Вік, Середній_бал
# Анна, 21, 8.5
# Петро, 20, 7.2
# Марія, 22, 9.0
# Іван, 19, 6.8
# ...
# Це початкова структура файлу csv, який потрібно створити і наповнити данними(бажано через пайтон)
# Задача:
#
# Завантажте дані з CSV файлу та збережіть їх у зручній для роботи структурі даних.
# Обчисліть середній вік студентів.
# Знайдіть студента з найвищим середнім балом та виведіть його ім'я і бал.
# Порахуйте кількість студентів, які молодші за 20 років.
# Створіть новий CSV файл, в який запишете імена студентів, вік та середній бал, але
# відсортовані за спаданням середнього балу.

# ps: можна використовувати загальний клас(методи класу), наслідування(якщо потрібно), а також функ
# ціональний підхід(пам'ятай кожен крок це функція нова, 1 функція відповідає за одну дію))

