# Как вы знаете, раньше телефоны были кнопочными, да и сейчас они существуют.
# И текстовые сообщения набирались при помощи цифровых кнопок. Как инженеры телефонов
# создали возможность набора текста? Решение было в том, что одна кнопка была ассоциирована
# сразу с несколькими буквами, а выбор зависел от количества нажатий на кнопку. Однократное
# нажатие приводило к появлению первой буквы в соответствующем этой кнопке списке,
# последующие нажатия меняли ее на следующую.
#
# Символы, соответствующие кнопкам на телефонах
#
# Кнопка	Символы
# 1	. , ? ! :
# 2	A B C
# 3	D E F
# 4	G H I
# 5	J K L
# 6	M N O
# 7	P Q R S
# 8	T U V
# 9	W X Y Z
# 0	Пробел
# Напишите функцию sequence_buttons, отображающую последовательность кнопок, которую
# необходимо нажать, чтобы на экране телефона появился текст, введенный пользователем.
#
# Создайте словарь, сопоставляющий символы с кнопками, которые необходимо нажать.
#
# Пример: если функции sequence_buttons передать строку "Hello, World!", функция должна
# вернуть "4433555555666110966677755531111".
#
# Требования:
#
# функция корректно обрабатывает строчные и прописные буквы.
# функция игнорирует символы, не входящие в указанный перечень

def sequence_buttons(string: str):
    SYMBOLS = [' ', '.,?!:', 'ABC', 'DEF', 'GHI', 'JKL', 'MNO', 'PQRS', 'TUV', 'WXYZ']
    TRANS = {}
    for i in range(len(SYMBOLS)):
        for j in range(len(SYMBOLS[i])):
            TRANS[ord(SYMBOLS[i][j])] = str(i) * (j + 1)
    return string.upper().translate(TRANS)


if __name__ == "__main__":
    print(sequence_buttons("Hello, World!"))

