# Всем известно, что для доступа к кредитной карте банка необходим пин-код. Классически сложилось,
# что это сочетание четырех цифр. Нам необходимо решить следующую программистскую задачу.
# Есть подготовленный список пин-кодов. Напишите функцию is_valid_pin_codes, которая будет
# принимать в качестве параметра список этих пин-кодов — строка из четырех цифр, и возвращать
# логическое значение — валидный список или нет. Убедитесь в том, что среди этих пин-кодов в
# списке не будет дубликатов, все они хранятся в виде строк, их длина равна 4 символам и содержат
# они только цифры.


