# Второй этап. Необходимо написать функцию is_valid_password,
# которая будет проверять полученный параметр — пароль на надежность.
#
# Критерии надежного пароля:
#
# 1 Длина строки пароля восемь символов.
# 2 Содержит хотя бы одну букву в верхнем регистре. (можна створити змінну наприклад has_upper)
# далі бігати по символах в строці і поставити умову if 'A' <= i <= 'Z': has_upper = True
# схоже прописати до 3, 4 пунктів
# 3 Содержит хотя бы одну букву в нижнем регистре.
# 4 Содержит хотя бы одну цифру.
# Функция is_valid_password должна вернуть True, если переданный в качестве параметра пароль
# отвечает требованиям надежности. В противном случае вернуть False.


